In [1]:
import pandas as pd

In [3]:
datos = pd.read_excel('./Data - Single Worksheet.xlsx')

In [4]:
datos.describe()

       First Name Last Name   City Gender
count           5         5      5      5
unique          5         5      5      2
top       Brandon     James  Miami      F
freq            1         1      1      3

In [5]:
datos.head()

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [7]:
datos['Last Name']

0      James
1    Hawkins
2        Day
3       Ruiz
4      Gomez
Name: Last Name, dtype: object

In [8]:
datos.sample(2)

  First Name Last Name           City Gender
3     Ashley      Ruiz  San Francisco      F
1       Sean   Hawkins         Denver      M

In [11]:
datos.columns

Index(['First Name', 'Last Name', 'City', 'Gender'], dtype='object')

In [13]:
datos[(datos['Gender']== 'M')]

  First Name Last Name    City Gender
0    Brandon     James   Miami      M
1       Sean   Hawkins  Denver      M

In [14]:
datos['City'].value_counts()

City
Miami            1
Denver           1
Los Angeles      1
San Francisco    1
Portland         1
Name: count, dtype: int64

In [15]:
datos.groupby('City')['First Name'].value_counts()

City           First Name
Denver         Sean          1
Los Angeles    Judy          1
Miami          Brandon       1
Portland       Stephanie     1
San Francisco  Ashley        1
Name: count, dtype: int64

In [16]:
conteo_genero = datos['Gender'].value_counts()

In [17]:
porcentaje_genero = (conteo_genero / len(datos)) * 100

In [18]:
print("Porcentaje por genero:")
print(porcentaje_genero)

Porcentaje por genero:
Gender
F    60.0
M    40.0
Name: count, dtype: float64

In [1]:
import matplotlib.pyplot as plt

In [2]:
pip install seaborn

Requirement already satisfied: seaborn in /home/jesica/jupyter_env/lib/python3.10/site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from seaborn) (2.2.4)
Requirement already satisfied: pandas>=1.2 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from seaborn) (2.2.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from seaborn) (3.10.1)
Requirement already satisfied: contourpy>=1.0.1 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.2)
Requirement already satisfied: cycler>=0.10 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.57.0)
Requirement already satisfied: kiwisolver>=1.3.1 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.8)
Requirement already satisfied: packaging>=20.0 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.2)
Requirement already satisfied: pillow>=8 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (11.2.1)
Requirement already satisfied: pyparsing>=2.3.1 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.3)
Requirement already satisfied: python-dateutil>=2.7 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in /home/jesica/jupyter_env/lib/python3.10/site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import seaborn as sns
sns.set(style="whitegrid")

In [8]:
sns.countplot

<function seaborn.categorical.countplot(data=None, *, x=None, y=None, hue=None, order=None, hue_order=None, orient=None, color=None, palette=None, saturation=0.75, fill=True, hue_norm=None, stat='count', width=0.8, dodge='auto', gap=0, log_scale=None, native_scale=False, formatter=None, legend='auto', ax=None, **kwargs)>